In [3]:
import numpy as np

In [5]:
import pandas as pd

In [11]:
myarr_1D = np.arange(5,11)

In [12]:
myarr_1D

array([ 5,  6,  7,  8,  9, 10])

In [22]:
create_2D = np.random.randint(1,100,size=(3,3))
create_2D

array([[ 4, 62, 92],
       [ 4, 23, 13],
       [33, 96, 79]], dtype=int32)

In [23]:
event_count = np.sum(create_2D % 2==0)

In [26]:
print("Even number count: ",event_count)

Even number count:  5

In [28]:
create_2D_5_4 = np.random.randint(1,10,size=(5,4))
create_2D_5_4

array([[6, 8, 6, 1],
       [3, 1, 4, 1],
       [5, 1, 8, 6],
       [5, 4, 2, 5],
       [6, 3, 2, 2]], dtype=int32)

In [29]:
np.mean(create_2D_5_4)

np.float64(3.95)

In [33]:
print("Column Mean:", np.mean(create_2D_5_4,axis=0))

Column Mean: [5.  3.4 4.4 3. ]

In [32]:
print("std:" ,np.std(create_2D_5_4))

std: 2.2466641938660974

In [36]:
input_data = {
'name': ['Alice','Bob','Jefin','David','Jude'], 
'math_score':[80, 64, 90, 72, 56], 
'english_score': [78, 85, 88, 69, 60]
}
data = pd.DataFrame(input_data)
data

    name  math_score  english_score
0  Alice          80             78
1    Bob          64             85
2  Jefin          90             88
3  David          72             69
4   Jude          56             60

In [39]:
data.rename(columns={'name':'student_name'},inplace=True)

In [49]:
data['average']=data[['math_score','english_score']].mean(axis=1).astype(np.int8)

In [52]:
data.drop(columns=['math_score','english_score'],inplace=True)

In [53]:
print(data)

  student_name  average
0        Alice       79
1          Bob       74
2        Jefin       89
3        David       70
4         Jude       58

In [54]:
df1 = pd.DataFrame({
    'empname': ['Iron Man', 'Captain America', 'Hawkeye'],
    'empid': [101, 102, 103]
})

df2 = pd.DataFrame({
    'empname': ['Thor', 'Black Widow', 'Hulk'],
    'empid': [201, 202, 203]
})

In [68]:
df = pd.concat([df1,df2],ignore_index=True)
df

           empname  empid
0         Iron Man    101
1  Captain America    102
2          Hawkeye    103
3             Thor    201
4      Black Widow    202
5             Hulk    203

In [69]:
print(df)

           empname  empid
0         Iron Man    101
1  Captain America    102
2          Hawkeye    103
3             Thor    201
4      Black Widow    202
5             Hulk    203

In [77]:
data2=pd.DataFrame(columns=['Name','Age'],index=[1,2,3])
data2

  Name  Age
1  NaN  NaN
2  NaN  NaN
3  NaN  NaN

In [78]:
data2.name = 'Student Info'
data2.index.name = 'ID'
data2
data2.loc[1] = ['Mickey Mouse', 21]
data2.loc[2] = ['Elsa', 23]
data2.loc[3] = ['Simba', 19]
data2

            Name Age
ID
1   Mickey Mouse  21
2           Elsa  23
3          Simba  19

In [79]:
data2.sort_values(by='Age',ascending=False)

            Name Age
ID
2           Elsa  23
1   Mickey Mouse  21
3          Simba  19

In [82]:
top_2_names = data2[:2]['Name']
print(top_2_names)

ID
1    Mickey Mouse
2            Elsa
Name: Name, dtype: object

In [83]:
department={
'dept_id':   [10, 20, 30, 40],
'dept_name': ['HR', 'IT', 'Sales', 'Finance']
}
employees={
'emp_id': [1, 2, 3, 4, 5], 
'name': ['Alice','Bob','Revin','David','Devin'], 
'dept_id': [20, 10, 30, 50, 20],
'salary': [70000, 48000, 55000, 62000, 72000]
}

In [85]:
department_df = pd.DataFrame(department)
employees_df = pd.DataFrame(employees)
department_df,employees_df

(   dept_id dept_name
 0       10        HR
 1       20        IT
 2       30     Sales
 3       40   Finance,
    emp_id   name  dept_id  salary
 0       1  Alice       20   70000
 1       2    Bob       10   48000
 2       3  Revin       30   55000
 3       4  David       50   62000
 4       5  Devin       20   72000)

In [90]:
inner_merge = pd.merge(department_df,employees_df,on='dept_id')

In [91]:
left_merge = pd.merge(department_df,employees_df,on='dept_id',how='right')

In [92]:
print(inner_merge)
print(left_merge)

   dept_id dept_name  emp_id   name  salary
0       10        HR       2    Bob   48000
1       20        IT       1  Alice   70000
2       20        IT       5  Devin   72000
3       30     Sales       3  Revin   55000
   dept_id dept_name  emp_id   name  salary
0       20        IT       1  Alice   70000
1       10        HR       2    Bob   48000
2       30     Sales       3  Revin   55000
3       50       NaN       4  David   62000
4       20        IT       5  Devin   72000

In [94]:
data_stock = {
'item':  ['apple', 'banana', 'cherry', 'dates'],
'stock': [50, 20, 0, 30],
'price': [50, 20, 100, 150]
 }
data_stock_df = pd.DataFrame(data_stock,index=['A','B','C','D'])
data_stock_df

     item  stock  price
A   apple     50     50
B  banana     20     20
C  cherry      0    100
D   dates     30    150

In [99]:
data_stock_df.loc['C','stock'] = 10
data_stock_df

     item  stock  price
A   apple     50     50
B  banana     20     20
C  cherry     10    100
D   dates     30    150

In [103]:
price_row1_colum2= data_stock_df.iloc[1,2]
print(price_row1_colum2)

20

In [106]:
names={
'first_name': ['John', 'Jane', 'Alice', 'Bob'],
'last_name':  ['Doe',  'Smith','Johnson','Lee']
} 
names_df=pd.DataFrame(names)
names_df

  first_name last_name
0       John       Doe
1       Jane     Smith
2      Alice   Johnson
3        Bob       Lee

In [109]:
names_df['full_name']=names_df['first_name']+ ' ' +names_df['last_name']
names_df

  first_name last_name      full name      full_name
0       John       Doe       John Doe       John Doe
1       Jane     Smith     Jane Smith     Jane Smith
2      Alice   Johnson  Alice Johnson  Alice Johnson
3        Bob       Lee        Bob Lee        Bob Lee

In [110]:
orders={
'order_id':  [101, 102, 103, 104, 105, 106, 107], 
'product_category':['Electronics','Clothing','Electronics', 'Home','Clothing','Home','Electronics'], 
'order_value':  [250, 80, 120, 200, 50, 150, 300], 
'user_id':[1, 2,  1, 3, 2, 1, 2]
}
orders_df=pd.DataFrame(orders)
orders_df

   order_id product_category  order_value  user_id
0       101      Electronics          250        1
1       102         Clothing           80        2
2       103      Electronics          120        1
3       104             Home          200        3
4       105         Clothing           50        2
5       106             Home          150        1
6       107      Electronics          300        2

In [112]:
groupBy_user = orders_df.groupby('user_id')

In [118]:
order_count=groupBy_user['order_id'].count().reset_index(name='order_count')
average_order_value = groupBy_user['order_value'].mean().reset_index(name='order_mean')
order_count,average_order_value

(   user_id  order_count
 0        1            3
 1        2            3
 2        3            1,
    user_id  order_mean
 0        1  173.333333
 1        2  143.333333
 2        3  200.000000)

In [119]:
groupBy_product = orders_df.groupby('product_category')
average_order_value_product =  groupBy_product['order_value'].mean().reset_index(name='order_avg_product')
average_order_value_product

  product_category  order_avg_product
0         Clothing          65.000000
1      Electronics         223.333333
2             Home         175.000000